
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ТипНастройки = Перечисления.ТипыНастроекКВА.Примитивная Тогда
		Элементы.ГруппаПримитивная.Видимость = Истина;
	ИначеЕсли Объект.ТипНастройки = Перечисления.ТипыНастроекКВА.Ссылка Тогда
		Элементы.ГруппаСсылка.Видимость = Истина;
	ИначеЕсли Объект.ТипНастройки = Перечисления.ТипыНастроекКВА.Массив Тогда
		Элементы.ГруппаМассив.Видимость = Истина;
	Иначе // Перечисления.ТипыНастроекКВА.Хранилище
		Элементы.ГруппаХранилище.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти