
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	АдресСервера = Константы.АдресСервераГитлаб.Получить();
	Токен = Константы.ТокенСервераГитлаб.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
	ЭтотОбъект.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.АдресСервераГитлаб.Установить(АдресСервера);
	Константы.ТокенСервераГитлаб.Установить(Токен);
	
КонецПроцедуры
