#Область СлужебныйПрограммныйИнтерфейс

// Возвращает сохраненные ранее параметры
// Параметры:
//  ИдентификаторНастройки - Строка - Имя предопределенного или идентификатор
//
// Возвращаемое значение:
//   ЛюбойТип - Параметры по указанному имени, которые были ранее сохранены
//
Функция ПолучитьНастройки(ИдентификаторНастройки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос();
	Попытка
		РезультатСсылка = ПредопределенноеЗначение("Справочник.НастройкиХранилищеКВА." + ИдентификаторНастройки);
		Запрос.Текст = "ВЫБРАТЬ
		               |	НастройкиХранилищеКВА.ТипНастройки КАК ТипНастройки,
		               |	НастройкиХранилищеКВА.ЗначениеНастройкиПримитив КАК ЗначениеПримитив,
		               |	НастройкиХранилищеКВА.ЗначениеНастройкиСсылка КАК ЗначениеСсылка,
		               |	НастройкиХранилищеКВА.ЗначениеНастройкиХранилище КАК ЗначениеХранилище
		               |ИЗ
		               |	Справочник.НастройкиХранилищеКВА КАК НастройкиХранилищеКВА
		               |ГДЕ
		               |	НастройкиХранилищеКВА.Ссылка = &РезультатСсылка";
		Запрос.УстановитьПараметр("РезультатСсылка", РезультатСсылка);
	Исключение
		Запрос.Текст = "ВЫБРАТЬ
		               |	НастройкиХранилищеКВА.ТипНастройки КАК ТипНастройки,
		               |	НастройкиХранилищеКВА.ЗначениеНастройкиПримитив КАК ЗначениеПримитив,
		               |	НастройкиХранилищеКВА.ЗначениеНастройкиСсылка КАК ЗначениеСсылка,
		               |	НастройкиХранилищеКВА.ЗначениеНастройкиХранилище КАК ЗначениеХранилище,
		               |	НастройкиХранилищеКВА.МассивЗначений.(
		               |		ЗначениеУниверсальное КАК ЗначениеУниверсальное
		               |	) КАК МассивЗначений
		               |ИЗ
		               |	Справочник.НастройкиХранилищеКВА КАК НастройкиХранилищеКВА
		               |ГДЕ
		               |	НастройкиХранилищеКВА.ИдентификаторНастройки = &ИдентификаторНастройки
		               |	И НЕ НастройкиХранилищеКВА.ПометкаУдаления";
		Запрос.УстановитьПараметр("ИдентификаторНастройки", ИдентификаторНастройки);
	КонецПопытки;

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Количество() > 1 Тогда
			ТекстОшибки = "Ошибка получения данных настройки, множественная запись! Идентификатор: " + ИдентификаторНастройки;
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		Если Выборка.Следующий() Тогда
			Если Выборка.ТипНастройки = Перечисления.ТипыНастроекКВА.Примитивная Тогда
				Возврат Выборка.ЗначениеПримитив;
			ИначеЕсли Выборка.ТипНастройки = Перечисления.ТипыНастроекКВА.Ссылка Тогда
				Возврат Выборка.ЗначениеСсылка;
			ИначеЕсли Выборка.ТипНастройки = Перечисления.ТипыНастроекКВА.Массив Тогда
				Возврат Выборка.МассивЗначений.Выгрузить().ВыгрузитьКолонку("ЗначениеУниверсальное");
			Иначе
				Возврат Выборка.ЗначениеХранилище.Получить();
			КонецЕсли;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#КонецОбласти