
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КонстантаПутьКГлобальнымСпискам = Константы.ПутьКГлобальнымСпискам.Получить();
	УстановитьДоступность();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийэлементовФормы

&НаКлиенте
Процедура КонстантаПутьКГлобальнымСпискамНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОО = Новый ОписаниеОповещения("КонстантаПутьКГлобальнымСпискамНачалоВыбораЗавершение", ЭтотОбъект);
	ФайловаяСистемаКлиент.ВыбратьКаталог(ОО, "Выберите каталог для сохранения глобальных списков",
		КонстантаПутьКГлобальнымСпискам);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда = Неопределено)
	СохранитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда = Неопределено)
	СохранитьНаСервере();
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНаСервере()
	
	ФункционалДоступен = Пользователи.РолиДоступны("УправлениеГлобальнымиСпискамиБаз");
	Если ФункционалДоступен Тогда
		Константы.ПутьКГлобальнымСпискам.Установить(КонстантаПутьКГлобальнымСпискам);
	КонецЕсли;
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемПодтверждениеПолучено", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(ОписаниеОповещения, Отказ, ЗавершениеРаботы,
		, ТекстПредупреждения);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемПодтверждениеПолучено(РезультатВопроса, ДополнительныеПараметры) Экспорт
	СохранитьИЗакрыть();
КонецПроцедуры

&НаКлиенте
Процедура КонстантаПутьКГлобальнымСпискамНачалоВыбораЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	КонстантаПутьКГлобальнымСпискам = РезультатВыбора;
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность()
	
	МассивДоступов = Новый Массив;
	
	ФункционалДоступен = Пользователи.РолиДоступны("УправлениеГлобальнымиСпискамиБаз");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаГлобальныеСпискиБаз",
		"ТолькоПросмотр",
		Не ФункционалДоступен);
	МассивДоступов.Добавить(ФункционалДоступен);
	
	ЕстьРедактируемые = МассивДоступов.Найти(Истина);
	ТолькоПросмотр = Не ЕстьРедактируемые;
	
КонецПроцедуры

#КонецОбласти
