#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивДоступов = Новый Массив;
	
	ФункционалДоступен = Пользователи.РолиДоступны("УправлениеГлобальнымиСпискамиБаз");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПутьКГлобальнымСпискамГруппа",
		"ТолькоПросмотр",
		Не ФункционалДоступен);
	МассивДоступов.Добавить(ФункционалДоступен);
	
	ЕстьРедактируемые = МассивДоступов.Найти(Истина);
	ТолькоПросмотр = Не ЕстьРедактируемые;
	
КонецПроцедуры

#КонецОбласти
