#Область ПрограммныйИнтерфейс

// Преобразует текст формата json в нативный тип 1С (структура или массив)
//
// Параметры:
//  СообщениеТекст  - Строка - json-строка
//
// Возвращаемое значение:
//   Структура, Массив - Полученные из строки json данные
//
Функция ПолучитьСтруктуруИзТекстаJSON(СообщениеТекст) Экспорт

	Попытка
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(СообщениеТекст);
		Данные = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Исключение
		ВызватьИсключение "Ошибка разбора json: " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Данные;

КонецФункции // ПолучитьСтруктуруИзТекста()

// Преобразует структуру или массив в текст формата json
//
// Параметры:
//  СообщениеСтруктура  - Структура, Массив - Структура или массив структур
//
// Возвращаемое значение:
//   Строка - текст формата json
//
Функция ЗаписатьСтруктуруВJSON(СообщениеСтруктура) Экспорт
	
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Unix, "  ");
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(ЗаписьJSON, СообщениеСтруктура);
	Сообщение = ЗаписьJSON.Закрыть();
	
	Возврат Сообщение;
	
КонецФункции

#КонецОбласти
