#Область ПрограммныйИнтерфейс

// Вызывается из GET метода шаблона ИсполнениеМетодовОбщихМодулей http сервиса rest_api
//
//Пример реализации rest api для url http://server/hs/rest-api/my-module/my-method?param1=value&param2=value:
//	НоваяСтрока = Шаблоны.Добавить();
//	НоваяСтрока.ОбщийМодуль = "ИмяОбщегоМодуля";
//	НоваяСтрока.Метод = "ИмяЭкспортногоМетода";
//	НоваяСтрока.module = "my-module";
//	НоваяСтрока.method = "my-method";
//	НоваяСтрока.ИспользоватьПараметры = Истина;
//  // Истина если планируем передавать параметры (?param1=value&param2=value) в метод общего модуля
//
//Имеется возможность удалить шаблоны добавленные библиотекой,
//	либо удалить все:
//		Шаблоны = Новый ТаблицаЗначений;	
//		Шаблоны.Колонки.Добавить("ОбщийМодуль");
//		Шаблоны.Колонки.Добавить("Метод");
//		Шаблоны.Колонки.Добавить("ИспользоватьПараметры");
//		Шаблоны.Колонки.Добавить("module");
//		Шаблоны.Колонки.Добавить("method");
//	либо удалить конкретный шаблон, вызвав метод удалить:
//		Шаблоны.Удалить(Строка);
//
// Параметры:
//  Шаблоны	 - ТаблицаЗначений - Список сопоставления методов общих модулей с короткими именами http
//
Процедура ДобавитьШаблонОбщегоМодуля(Шаблоны) Экспорт
	
КонецПроцедуры

#КонецОбласти