
#Область ПрограммныйИнтерфейс

// Для форм списков устанавливает отбор по доступным пользователю контурам
//
// Параметры:
//  Список  - ДинамическийСписок - список, у которого будет устанавливаться отбор
//                                 В запросе динамического списка должны быть реализованы
//                                 параметры ПоказыватьПродуктив и ПоказыватьНочныеКопии
//
Процедура УстановитьОтборКонтуров(Список)

КонецПроцедуры // УстановитьОтборКонтуров()

#КонецОбласти