
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	МесторасположениеРабочейБазы = Константы.МесторасположениеРабочейБазыКВА.Получить();
	
	ДополнитьРасширяемымиРеквизитами();
	НастройкиКВАПереопределяемый.ПриСозданииФормыАдминистрирования(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ЗаписатьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НастройкиНажатие(Элемент)
	НастройкиКВАКлиентПереопределяемый.ОбработчикНажатияНастройки(Элемент);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеВидимостью()
	НастройкиКВАКлиентПереопределяемый.УправлениеВидимостьюФормыАдминистрирования(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройки()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Константы.МесторасположениеРабочейБазыКВА.Установить(МесторасположениеРабочейБазы);
	
	НастройкиКВАПереопределяемый.ЗаписатьНастройки(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьРасширяемымиРеквизитами()

	СтруктураРеквизитов = Новый Структура();
	НастройкиКВАПереопределяемый.ДополнитьНовымиРеквизитами(СтруктураРеквизитов);
	Если СтруктураРеквизитов.Количество() > 0 Тогда
		СозданиеЭлементовФорм.СоздатьРеквизиты(ЭтотОбъект, СтруктураРеквизитов);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
