#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнформационнаяБаза = Параметры.ИнформационнаяБаза;
	ПараметрЗапуска = Параметры.ПараметрЗапуска;
	ТипКлиентскогоПриложения = Параметры.ТипКлиентскогоПриложения;
	СкоростьКлиентскогоСоединения = Параметры.СкоростьКлиентскогоСоединения;
	ВерсияПлатформы = Параметры.ВерсияПлатформы;
	РазрядностьКлиентскогоПриложения = Параметры.РазрядностьКлиентскогоПриложения;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИнформационнаяБаза", ИнформационнаяБаза);
	ДопПараметры.Вставить("ВерсияПлатформы", ВерсияПлатформы);
	ДопПараметры.Вставить("РазрядностьКлиентскогоПриложения", РазрядностьКлиентскогоПриложения);
	ДопПараметры.Вставить("ТипКлиентскогоПриложения", ТипКлиентскогоПриложения);
	ДопПараметры.Вставить("СкоростьКлиентскогоСоединения", СкоростьКлиентскогоСоединения);
	ДопПараметры.Вставить("ПараметрЗапуска", ПараметрЗапуска);
	
	ЭтаФорма.Закрыть(ДопПараметры);
	
КонецПроцедуры

#КонецОбласти
