Функция ВыполнитьNSLOOKUP(Параметр) Экспорт 
	
	Перем КодВозврата;
	ИмяФайла = ПолучитьИмяВременногоФайла("txt");

	ЗапуститьПриложение(СтрШаблон("cmd ""/c nslookup %1 > ""%2""""", Параметр, ИмяФайла),,Истина, КодВозврата);
	
	Если КодВозврата <> Неопределено И КодВозврата = 0 Тогда
		Файл = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.Системная);
		ВыводКоманды = СтрРазделить(Файл.Прочитать(), Символы.ПС, Ложь);
		Файл.Закрыть();
	Иначе
		ВызватьИсключение НСтр("ru = 'Не удалось выполнить команду NSLOOKUP'");
	КонецЕсли;
	
	УдалитьФайлы(ИмяФайла);

	Результат = Новый Структура("Hostname,IP", "", "");
	Если ВыводКоманды.Количество() > 2 Тогда
		Результат.Hostname = СтрЗаменить(СокрЛП(СтрРазделить(ВыводКоманды[2], ":")[1]), ".vsmpo-avisma.ru", "");
		Результат.IP = СокрЛП(СтрРазделить(ВыводКоманды[3], ":")[1]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
