#Область ПрограммныйИнтерфейс

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Отказ = HostnameСуществует();
	Наименование = ?(ПустаяСтрока(Наименование), Hostname, Наименование);
	IP = ?(ПустаяСтрока(IP), Справочники.Серверы.ВыполнитьNSLOOKUP(Hostname).IP, IP);
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция HostnameСуществует()
	
	Запрос = ЗапросыВызовСервера;
	
	ОписаниеЗапроса = Запрос.ПолучитьОписаниеЗапроса();
	ОписаниеУсловия = Запрос.ПолучитьОписаниеУсловия();
	
	ОписаниеЗапроса.Элемент = Ссылка;
	ОписаниеЗапроса.Реквизиты.Добавить("Ссылка");
	
	ОписаниеУсловия.ЛевоеЗначение = "Ссылка";
	ОписаниеУсловия.ПравоеЗначение = Ссылка;
	ОписаниеУсловия.НеСодержит = Истина;
	ОписаниеЗапроса.Условие.Добавить(ОписаниеУсловия);
	
	ОписаниеУсловия.ЛевоеЗначение = "Hostname";
	ОписаниеУсловия.ПравоеЗначение = Hostname;
	ОписаниеУсловия.НеСодержит = Ложь;
	ОписаниеЗапроса.Условие.Добавить(ОписаниеУсловия);
	
	РезультатЗапроса = Запрос.ПолучитьДанныеОбъектаПоСсылкеНаЭлемент(ОписаниеЗапроса);
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
