#Область ПрограммныйИнтерфейс

// Возвращает имя формы, на которой реализовано управление параметрами
//
// Параметры:
//  Ссылка  - СправочникСсылка.НастройкиХранилищеКВА - Ссылка на объект настроек
//
// Возвращаемое значение:
//   Строка - Имя формы
//
Функция ПолучитьИмяФормы(Ссылка) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Процедура ПриСозданииФормыАдминистрирования(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ЗаписатьНастройки(Форма) Экспорт
	
КонецПроцедуры

// Процедура для добавления на форму администрирования реквизитов
//
// Параметры:
//  СтруктураРеквизитов  - Структура - Структура с описанием новых реквизитов, 
//                                     ключ=имя реквизита, значение=тип реквизита
//
Процедура ДополнитьНовымиРеквизитами(СтруктураРеквизитов) Экспорт
	
КонецПроцедуры // ДополнитьНовымиРеквизитами()

#КонецОбласти