
&НаСервереБезКонтекста
Функция ОбновитьТегиНаСервере(ПроектСсылка)
	Возврат Справочники.Проекты.ВеткиПроекта(ПроектСсылка);
КонецФункции

&НаКлиенте
Процедура ОбновитьТеги(Команда)
	МассивТегов = ОбновитьТегиНаСервере(Объект.Ссылка);
	СписокТегов.ЗагрузитьЗначения(МассивТегов);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры



