
&НаКлиенте
Процедура ЗаполнитьИД(Команда)
	
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо записать!");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьИДНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИДНаСервере()
	ПараметрыСервера = Справочники.СерверыПриложений1С.ПолучитьПараметрыСервера(Объект.Ссылка);
	Объект.ИДКластера = АдминистрированиеКластера.ИдентификаторКластера(ПараметрыСервера);
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры
