Функция ПолучитьПараметрыИБ(База) Экспорт
	ПараметрыИБ = АдминистрированиеКластера.ПараметрыАдминистрированияИнформационнойБазыКластера();
	ПараметрыИБ.ИмяВКластере = База.Наименование;
	ПараметрыИБ.ИмяАдминистратораИнформационнойБазы = База.АвторизационныеДанные.Логин;
	ПараметрыИБ.ПарольАдминистратораИнформационнойБазы = База.АвторизационныеДанные.Пароль;
	
	Возврат  ПараметрыИБ;
	
КонецФункции

Функция БазаСуществует(ИмяИБ, Ссылка, ЭтоНовый) Экспорт

	СтароеНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Наименование");
	Если ЭтоНовый ИЛИ (СтароеНаименование <> ИмяИБ) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИнформационныеБазы1С.Наименование КАК Наименование
			|ИЗ
			|	Справочник.ИнформационныеБазы1С КАК ИнформационныеБазы1С
			|ГДЕ
			|	ИнформационныеБазы1С.Наименование = &Наименование";
		
		Запрос.УстановитьПараметр("Наименование", ИмяИБ);
		
		РезультатЗапроса = Запрос.Выполнить();
		Возврат НЕ РезультатЗапроса.Пустой();
	Иначе
		Возврат Ложь;
	КонеЦесли;
	
КонецФункции

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|  ЭтоАвторизованныйПользователь(Пользователь)
	|  ИЛИ(ЗначениеРазрешено(Контур, ПустаяСсылка КАК Истина) И ЧтениеОбъектаРазрешено(Проект))
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|    ЭтоАвторизованныйПользователь(Пользователь)
	|";

КонецПроцедуры
