Процедура ПередЗаписью(Отказ) Экспорт
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Наименование = СокрЛП(Наименование);

	Если НЕ ДополнительныеСвойства.Свойство("ПровереноИнтерактивно") Тогда
		//Проверка уникальности наименования.
		Если Справочники.ИнформационныеБазы1С.БазаСуществует(Наименование, Ссылка, ЭтоНовый()) Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("База с именем " + Наименование + " существует!");
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры






