#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьНастройки() Экспорт
	
	Возврат ЗначениеНастройкиХранилище.Получить();
	
КонецФункции

Процедура ЗаписатьНастройки(НастройкиСтруктура) Экспорт
	
	ЗначениеНастройкиХранилище = Новый ХранилищеЗначения(НастройкиСтруктура, Новый СжатиеДанных(6));
	// сбросим кэш
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли