#Область ПрограммныйИнтерфейс

// Дополнительная обработка видимости элементов формы
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма администрирования
//
Процедура УправлениеВидимостьюФормыАдминистрирования(Форма) Экспорт
	
КонецПроцедуры // УправлениеВидимостьюФормыАдминистрирования()

// Дополнительный обработчик открытия формы настройки
//
// Параметры:
//  Элемент - ЭлементЭлементФормы - активированный элемент формы
//
Процедура ОбработчикНажатияНастройки(Элемент) Экспорт
	
	Возврат;
	
КонецПроцедуры // ОбработчикНажатияНастройки()

// Интерфейс для вызова функции, формирующей сообщение пользователю
// Для БСП использовать
// ОбщегоНазначенияКлиент.СообщитьПользователю(,,,,);
//
// Параметры:
//  ТекстСообщенияПользователю - Строка - текст сообщения.
//  КлючДанных - ЛюбаяСсылка - объект или ключ записи информационной базы, к которому это сообщение относится.
//  Поле - Строка - наименование реквизита формы.
//  ПутьКДанным - Строка - путь к данным (путь к реквизиту формы).
//  Отказ - Булево - выходной параметр, всегда устанавливается в значение Истина.
//
Процедура СообщитьПользователю(
	Знач ТекстСообщенияПользователю,
	Знач КлючДанных = Неопределено,
	Знач Поле = "",
	Знач ПутьКДанным = "",
	Отказ = Ложь) Экспорт

КонецПроцедуры // СообщитьПользователю()

#КонецОбласти