#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ДоступнаРоль = Пользователи.РолиДоступны("УправлениеГлобальнымиСпискамиБаз");
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, 
		"ФормаПоказыватьГлобальные",
		"Доступность",
		ДоступнаРоль);
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Глобальный",
		Ложь,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказыватьГлобальные(Команда)
	
	Элементы.ФормаПоказыватьГлобальные.Пометка = Не Элементы.ФормаПоказыватьГлобальные.Пометка;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Глобальный",
		Ложь,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Не Элементы.ФормаПоказыватьГлобальные.Пометка);
	
КонецПроцедуры

#КонецОбласти
